import Button from "@mui/material/Button";

const Service = () => {
  const places = [
    {
      id: 1,
      name: "Шилийн богд",
      description:
        "Алтан-Овоо нь Сүхбаатар аймгийн нутагт Молцог элсний хойд зах Дарьганга сумын төвийн дэргэд оршдог. 1354 м өндөр шовгор хэлбэр нь эвдрээгүй үлдсэн бөгөөд галт уулсын хүрмэн чулуу их.",
      image: "shiliinBogd.jpg",
    },
    {
      id: 2,
      name: "Хамрын хийд",
      description:
        "Дорноговь аймгийн төв Сайншанд хотоос урагш 45 километрт байдаг. XIX зууны үеийн Монголын нэрт соён гэгээрүүлэгч, яруу найрагч, ноён хутагт Д.Данзанравжаа 1820 онд 17 насандаа Өвөр хамар гэдэг газар Хамрын хийдийг байгуулжээ.",
      image: "licensed-image.jpeg",
    },
    {
      id: 3,
      name: "Говь гурван сайхан",
      description:
        "Өмнөговь аймгийн төв Даланзадгадаас баруун тийш 180 километр цувран үргэлжилсэн хэд хэдэн нуруунаас тогтох Баруунсайхан, Дундсайхан, Зүүнсайхан хэмээх 3 том нуруу.",
      image: "licensed-image (1).jpeg",
    },
    {
      id: 4,
      name: "Хэрмэн цав",
      description:
        "   Өмнөговь аймгийн Гурван тэс сумын нутаг дахь Хүний хөл төдийлөн хүрээгүй, эртний үлэг гүрвэлийн өлгий нутаг, их далайн ай сав байсан ба үлэг гүрвэлийн яс, палеонтлогийн олдвороор баялаг нутаг.",
      image: "tree.jpg",
    },
    {
      id: 5,
      name: "Тэрхийн цагаан нуур",
      description:
        "  Архангай аймгийн Тариат сум. Гарал үүслийн хувьд девоны үеийн боржин чулуу, дөрөвдөгч галавын галт уулын чулуулгаас тогтоно. Унтарсан галт уулын гүнзгий өрх, хүрмэн хад, цохио ангал агуй асга хоргодох газар ирхтэй тул Хорго гэж нэрлэсэн. Амсар нь 300-400м, гүн нь 70-80 м, гадна талын налуу нь 35-40 хэм, тогооны дотор налуу нь 45-50 хэм. Тэрхийн Цагаан нуур д.т. дээш 2060 метр өндөрт байдаг. Нуурт 10 гол цутгадаг, цэвэр устай, урт 16 км, өргөн 5-6 км, гүн 6-20 м. Ганц Суман гол тэндээс эх аван урсдаг. Дундаа жижиг аралтай.",
      image: "horgo.jpg",
    },
    {
      id: 6,
      name: "Цагаан гол",
      description:
        "Цагаан гол нь Монголын орны үзэсгэлэнт газруудын нэг юм. Үүнийг 1990 онд Монголын орны үзэсгэлэнт газруудын нэвтэрхийгээр нэвтрүүлэхэд 1991 онд үүсгэсэн. Цагаан гол нь 1992 онд Монголын орны үзэсгэлэнт газруудын нэвтэрхийгээр нэвтрүүлэхэд 1993 онд үүсгэсэн.",
      image: "tsagaan.jpg",
    },
    {
      id: 7,
      name: "Бага газрын чулуу",
      description:
        "Бага газрын чулуу нь Монголын орны үзэсгэлэнт газруудын нэг юм. Үүнийг 1990 онд Монголын орны үзэсгэлэнт газруудын нэвтэрхийгээр нэвтрүүлэхэд 1991 онд үүсгэсэн. Цагаан гол нь 1992 онд Монголын орны үзэсгэлэнт газруудын нэвтэрхийгээр нэвтрүүлэхэд 1993 онд үүсгэсэн.",

      image: "baga.jpg",
    },
    {
      id: 8,
      name: "Бурхан халду",
      description:
        "Бурхан халду нь Монголын орны үзэсгэлэнт газруудын нэг юм. Үүнийг 1990 онд Монголын орны үзэсгэлэнт газруудын нэвтэрхийгээр нэвтрүүлэхэд 1991 онд үүсгэсэн. Цагаан гол нь 1992 онд Монголын орны үзэсгэлэнт газруудын нэвтэрхийгээр нэвтрүүлэхэд 1993 онд үүсгэсэн.",
      image: "haldun.jpg",
    },
    {
      id: 9,
      name: "Ээж хайрхан",
      description:
        "     Говь-Алтай аймгийн Цогт сумын нутаг Захуйзарманы говьд байдаг. Уулын",
      image: "eej.png",
    },
    // Үлдсэн газруудыг энд нэмнэ
  ];

  return (
    <div className="w-full min-h-screen bg-gray-100">
      <div className="max-w-7xl mx-auto py-12 px-4 sm:px-6 lg:px-8">
        <h1 className="text-4xl font-extrabold text-gray-900 text-center mb-12">
          Монгол орны <span className="text-green-600">үзэсгэлэнт </span>{" "}
          газрууд
        </h1>

        {places.map((place) => (
          <div
            key={place.id}
            className="relative bg-gray-900 text-white rounded-lg overflow-hidden mb-12 h-[500px]"
          >
            <img
              className="absolute w-full h-full object-cover"
              src={place.image}
              alt={place.name}
            />
            <div className="absolute inset-0 bg-gradient-to-t from-black via-transparent to-transparent opacity-90"></div>
            <div className="relative z-10 p-12 h-full flex flex-col justify-end text-shadow-lg">
              <span className="text-green-400 text-lg font-bold">
                0{place.id}
              </span>
              <h2 className="text-4xl font-extrabold mt-2 text-white">
                {place.name}
              </h2>
              <p className="mt-4 text-gray-100">{place.description}</p>
              <Button className="mt-8 bg-green-500 hover:bg-green-600 text-white font-bold py-3 px-6 rounded-lg self-start">
                Дэлгэрэнгүй
              </Button>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
};

export default Service;
